# DDL Commands
#### CREATE, ALTER, DROP, TRUNCATE, COMMENT, RENAME

In [1]:
import mysql
from mysql import connector

In [2]:
mydb = connector.connect(
  host="localhost",
  user="vikram",
  password="123"
)

print(mydb)

<mysql.connector.connection_cext.CMySQLConnection object at 0x00000267ECAE7850>

In [3]:
myCursor = mydb.cursor()

In [5]:
myCursor.execute("DROP DATABASE DDL_database_1_py")

In [6]:
myCursor.execute("CREATE DATABASE DDL_database_1_py")

In [7]:
myCursor.execute("SHOW DATABASES")

for x in myCursor:
  print(x)

('chinook',)
('company',)
('db',)
('ddl_database_1',)
('ddl_database_1_py',)
('dml_database_2',)
('giraffe',)
('hr',)
('hr_emp',)
('information_schema',)
('lion',)
('mydb',)
('mysql',)
('oracle',)
('orders',)
('performance_schema',)
('smapledatabase',)
('sys',)

#### Connecting To Database

In [8]:
DDL_database_1_py = connector.connect(  
                                host="localhost",
                                user="vikram",
                                password="123",
                                database="DDL_database_1_py"
    )
DDL_1_py = DDL_database_1_py.cursor()

#### CREATE

In [9]:
DDL_1_py.execute("CREATE TABLE CUSTOMERS(customer_id INT, first_name VARCHAR(20), last_name VARCHAR(20),country VARCHAR(20))")
DDL_1_py.execute("CREATE TABLE employees(emp_id INT, first_name VARCHAR(20), last_name VARCHAR(20),salary INT)")

DDL_1_py.execute("SHOW TABLES")
for x in DDL_1_py:
    print(x)

('customers',)
('employees',)

#### DROP

In [10]:
DDL_1_py.execute("DROP TABLE customers")
DDL_1_py.execute("SHOW TABLES")
for x in DDL_1_py:
    print(x)

('employees',)

In [11]:
DDL_1_py.execute("DESCRIBE EMPLOYEES")
for x in DDL_1_py:
    print(x)

('emp_id', b'int', 'YES', '', None, '')
('first_name', b'varchar(20)', 'YES', '', None, '')
('last_name', b'varchar(20)', 'YES', '', None, '')
('salary', b'int', 'YES', '', None, '')

#### ALTER --> CHANGE

In [12]:
DDL_1_py.execute("ALTER TABLE employees CHANGE first_name fname VARCHAR(30)")
DDL_1_py.execute("DESCRIBE EMPLOYEES")
for x in DDL_1_py:
    print(x)

('emp_id', b'int', 'YES', '', None, '')
('fname', b'varchar(30)', 'YES', '', None, '')
('last_name', b'varchar(20)', 'YES', '', None, '')
('salary', b'int', 'YES', '', None, '')

#### ALTER --> MODIFY

In [13]:
DDL_1_py.execute("ALTER TABLE employees MODIFY fname VARCHAR(20)")
DDL_1_py.execute("DESCRIBE EMPLOYEES")
for x in DDL_1_py:
    print(x)

('emp_id', b'int', 'YES', '', None, '')
('fname', b'varchar(20)', 'YES', '', None, '')
('last_name', b'varchar(20)', 'YES', '', None, '')
('salary', b'int', 'YES', '', None, '')

#### ALTER --> ADD COLUMN

In [14]:
DDL_1_py.execute("ALTER TABLE employees ADD COLUMN country VARCHAR(20)")
DDL_1_py.execute("DESCRIBE EMPLOYEES")
for x in DDL_1_py:
    print(x)

('emp_id', b'int', 'YES', '', None, '')
('fname', b'varchar(20)', 'YES', '', None, '')
('last_name', b'varchar(20)', 'YES', '', None, '')
('salary', b'int', 'YES', '', None, '')
('country', b'varchar(20)', 'YES', '', None, '')

#### ALTER --> ADD COLUMN AFTER

In [15]:
DDL_1_py.execute("ALTER TABLE employees ADD middle_name VARCHAR(20) after fname")
DDL_1_py.execute("DESCRIBE EMPLOYEES")
for x in DDL_1_py:
    print(x)

('emp_id', b'int', 'YES', '', None, '')
('fname', b'varchar(20)', 'YES', '', None, '')
('middle_name', b'varchar(20)', 'YES', '', None, '')
('last_name', b'varchar(20)', 'YES', '', None, '')
('salary', b'int', 'YES', '', None, '')
('country', b'varchar(20)', 'YES', '', None, '')

#### ALTER --> DROP COLUMN

In [16]:
DDL_1_py.execute("ALTER TABLE employees DROP column middle_name")
DDL_1_py.execute("DESCRIBE EMPLOYEES")
for x in DDL_1_py:
    print(x)

('emp_id', b'int', 'YES', '', None, '')
('fname', b'varchar(20)', 'YES', '', None, '')
('last_name', b'varchar(20)', 'YES', '', None, '')
('salary', b'int', 'YES', '', None, '')
('country', b'varchar(20)', 'YES', '', None, '')

#### RENAME

In [17]:
DDL_1_py.execute("RENAME TABLE employees to employees_info")
DDL_1_py.execute("DESCRIBE employees_info")
for x in DDL_1_py:
    print(x)

('emp_id', b'int', 'YES', '', None, '')
('fname', b'varchar(20)', 'YES', '', None, '')
('last_name', b'varchar(20)', 'YES', '', None, '')
('salary', b'int', 'YES', '', None, '')
('country', b'varchar(20)', 'YES', '', None, '')

In [18]:
DDL_1_py.execute("DROP TABLE employees_info")
DDL_1_py.execute("SHOW TABLES")
for x in DDL_1_py:
    print(x)